######################################
# Install Taps
######################################
tap 'homebrew/bundle'
tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"


######################################
# Install Binaries
######################################
brew "git"
brew "git-lfs"
brew "diff-so-fancy" # lib git
brew "mas"           # appstore app installer
brew "wget" 
brew "tree"
brew "dockutil"


######################################
# Install Bash 4
######################################
brew "bash"


######################################
# Install ZSH
######################################
brew "zsh"
brew "antigen"


######################################
# Install Neovim
######################################
brew "neovim"


######################################
# Install VM
######################################
cask "docker"


######################################
# Install Fonts
######################################
cask "font-hack-nerd-font"


######################################
# Install server tools
######################################
brew "ssh-copy-id"



######################################
# Install some CTF tools
######################################
# brew "aircrack-ng"
# brew "bfg"
# brew "binutils"
# brew "binwalk"
# brew "cifer"
# brew "dex2jar"
# brew "dns2tcp"
# brew "fcrackzip"
# brew "foremost"
# brew "hashpump"
# brew "hydra"
# brew "john"
# brew "knock"
# brew "netpbm"
brew "nmap"
# brew "pngcheck"
# brew "socat"
# brew "sqlmap"
# brew "tcpflow"
# brew "tcpreplay"
brew "tcptrace"
# brew "ucspi-tcp" # `tcpserver` etc.
# brew "xpdf"
# brew "xz"


######################################
# Install Requirement apps
######################################
# Termial
cask "iterm2"

# DevTools
cask "plistedit-pro"
cask "visual-studio-code"  # Code editor
cask "cyberduck"           # SFTP Client
cask "teamsql"             # DB tool
cask "postman"             # API TEST Client
brew "gettext", link: true # Translation file
brew "imagemagick"

# Browser
cask "google-chrome"
cask "google-chrome-canary"

# Mail Client
mas "Spark", id: 1176895641

# Development Environment
mas "Xcode", id: 497799835

# DevOps
cask "slack"

# Utils
cask "scroll-reverser"              # Mouse scroll reverser
cask "appcleaner"                   # macOS apps uninstaller
mas "Bandizip", id: 1265704574      # macOS unzip app
mas "Memory Clean", id: 451444120   # macOS system memory cleaner
mas "Magnet", id: 441258766         # macOS window spliter

######################################
# Install Private apps
######################################
cask "iina" # Media player
cask "yt-music"

mas "KakaoTalk", id: 869223134
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Microsoft PowerPoint", id: 462062816

