######################################
# Install Taps
######################################
tap 'homebrew/bundle'
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"


######################################
# Install Binaries
######################################
brew "git"
brew "git-lfs"
brew "git-flow-avh"
brew "diff-so-fancy" # lib git
brew "mas"           # appstore app installer
brew "wget" 
brew "tree"
brew "dockutil"
brew "gnu-getopt"


######################################
# Install Bash 4
######################################
brew "bash"


######################################
# Install ZSH
######################################
brew "zsh"
brew "antigen"


######################################
# Install Neovim
######################################
brew "neovim"


######################################
# Install VM
######################################
cask "docker"


######################################
# Install Fonts
######################################
cask "font-hack-nerd-font"


######################################
# Install server tools
######################################
brew "ssh-copy-id"



######################################
# Install some CTF tools
######################################
# brew "aircrack-ng"
# brew "bfg"
# brew "binutils"
# brew "binwalk"
# brew "cifer"
# brew "dex2jar"
# brew "dns2tcp"
# brew "fcrackzip"
# brew "foremost"
# brew "hashpump"
# brew "hydra"
# brew "john"
# brew "knock"
# brew "netpbm"
brew "nmap"
# brew "pngcheck"
# brew "socat"
# brew "sqlmap"
# brew "tcpflow"
# brew "tcpreplay"
# brew "tcptrace"
# brew "ucspi-tcp" # `tcpserver` etc.
# brew "xpdf"
# brew "xz"


######################################
# Install Requirement apps
######################################
# Keyboard
cask "karabiner-elements"

# Termial
cask "iterm2"

# DevTools
cask "visual-studio-code"  # Code editor
cask "cyberduck"           # SFTP Client
cask "postman"             # API TEST Client
brew "gettext", link: true # Translation file
brew "imagemagick"

# Browser
cask "google-chrome"

# Talk
cask "slack"

# Utils
cask "istat-menus"                  # Display sys info
cask "scroll-reverser"              # Mouse scroll reverser
cask "cursorsense"                  # Mouse moving window
cask "appcleaner"                   # macOS apps uninstaller

######################################
# Install Private apps
######################################
cask "authy"                        # 2way fac
cask "notion"                       # memo
cask "iina"                         # Media player
mas "Bandizip", id: 1265704574      # macOS unzip app
mas "Magnet", id: 441258766         # macOS window spliter
mas "KakaoTalk", id: 869223134
mas "NAVER VIBE", id: 1542568299
