######################################
# Install Taps
######################################
tap 'homebrew/bundle'
tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"


######################################
# Install Binaries
######################################
brew "git"
brew "diff-so-fancy" # lib git
brew "mas"           # appstore app installer
brew "wget"
brew "tree"
brew "dockutil"


######################################
# Install Bash 4
######################################
brew "bash"


######################################
# Install ZSH
######################################
brew "zsh"
brew "antigen"


######################################
# Install Neovim
######################################
brew "neovim"


######################################
# Install VM
######################################
brew "docker"
brew "docker-compose"
cask "virtualbox"
cask "vagrant"


######################################
# Install Fonts
######################################
cask "font-hack-nerd-font"


######################################
# Install Requirement apps
######################################
# Termial
cask "iterm2"

# DevTools
cask "visual-studio-code"  # Code editor
cask "cyberduck"           # SFTP Client
cask "tableplus"           # DB tool
cask "postman"             # API TEST Client
brew "gettext", link: true # Translation file

# Browser
cask "google-chrome"

# Mail client
cask "mailspring"

# DevOps
cask "slack"
mas "Trello", id: 1278508951

# Utils
cask "scroll-reverser" # Mouse scroll reverser
cask "appcleaner"      # Mac apps uninstaller
cask "betterzip"       # Unarchive

######################################
# Install Private apps
######################################
cask "microsoft-office"
cask "jandi"
cask "iina"

mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "KakaoTalk", id: 869223134
mas "벅스 플레이어", id: 1211096598
